Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD10_DFP/2.5.53/edc/ATSAMD10D14AU.PIC
      <edc:SFRDef edc:_addr="0x41006008" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnn-nn" edc:cname="FLOW" edc:impl="0xFFFFFFFB" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="MTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MTB">
            <edc:SFRFieldDef edc:cname="AUTOSTOP" edc:desc="Auto Stop Tracing" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AUTOHALT" edc:desc="Auto Halt Request" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WATERMARK" edc:desc="Watermark value" edc:nzwidth="0x1D"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100600C" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="BASE" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:AdjustPoint edc:_addr="0x41006010" edc:offset="0xEF0"/>
      <edc:SFRDef edc:_addr="0x41006F00" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ITCTRL" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:AdjustPoint edc:_addr="0x41006F04" edc:offset="0x9C"/>
      <edc:SFRDef edc:_addr="0x41006FA0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CLAIMSET" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41006FA4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CLAIMCLR" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:AdjustPoint edc:_addr="0x41006FA8" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x41006FB0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="LOCKACCESS" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41006FB4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="LOCKSTATUS" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41006FB8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="AUTHSTATUS" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41006FBC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DEVARCH" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:AdjustPoint edc:_addr="0x41006FC0" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x41006FC8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DEVID" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41006FCC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DEVTYPE" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41006FD0" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID4" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41006FD4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID5" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41006FD8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID6" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41006FDC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID7" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41006FE0" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID0" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41006FE4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID1" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41006FE8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID2" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41006FEC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID3" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41006FF0" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CID0" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41006FF4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CID1" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41006FF8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CID2" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41006FFC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CID3" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:AdjustPoint edc:_addr="0x41007000" edc:offset="0x80"/>
      <edc:SFRDef edc:_addr="0x41007080" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS0PRAS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SBMATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SBMATRIX">
            <edc:SFRFieldDef edc:cname="M0PR" edc:desc="Master 0 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:desc="Master 1 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:desc="Master 2 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:desc="Master 3 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M4PR" edc:desc="Master 4 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M5PR" edc:desc="Master 5 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M6PR" edc:desc="Master 6 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M7PR" edc:desc="Master 7 Priority" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41007084" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS0PRBS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SBMATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SBMATRIX">
            <edc:SFRFieldDef edc:cname="M8PR" edc:desc="Master 8 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M9PR" edc:desc="Master 9 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M10PR" edc:desc="Master 10 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M11PR" edc:desc="Master 11 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M12PR" edc:desc="Master 12 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M13PR" edc:desc="Master 13 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M14PR" edc:desc="Master 14 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M15PR" edc:desc="Master 15 Priority" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41007088" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS1PRAS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SBMATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SBMATRIX">
            <edc:SFRFieldDef edc:cname="M0PR" edc:desc="Master 0 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:desc="Master 1 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:desc="Master 2 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:desc="Master 3 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M4PR" edc:desc="Master 4 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M5PR" edc:desc="Master 5 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M6PR" edc:desc="Master 6 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M7PR" edc:desc="Master 7 Priority" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100708C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS1PRBS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SBMATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SBMATRIX">
            <edc:SFRFieldDef edc:cname="M8PR" edc:desc="Master 8 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M9PR" edc:desc="Master 9 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M10PR" edc:desc="Master 10 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M11PR" edc:desc="Master 11 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M12PR" edc:desc="Master 12 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M13PR" edc:desc="Master 13 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M14PR" edc:desc="Master 14 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M15PR" edc:desc="Master 15 Priority" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
